[
    {
        "title": "Can I rent a car in australia with a P-plate license?",
        "time created": "11/03/2019",
        "score": 2,
        "id": "azn6sp",
        "url": "https://www.reddit.com/r/askSingapore/comments/azn6sp/can_i_rent_a_car_in_australia_with_a_pplate/",
        "comments": [
            {
                "time created": "11/03/2019",
                "author": "CharlieJuliet",
                "score": 4,
                "comment": "I also advice you to get the most comprehensive insurance available from the car rental company. In case you get into an accident, it will reduce the excess that you have to pay to the minimum.\n\nNot saying that you're a shitty driver, but you're a new driver and the GoR is a windy piece of road and I'm sure you'll be rubbernecking at the sights. Stay safe, have fun."
            },
            {
                "time created": "11/03/2019",
                "author": "SnottyMartian",
                "score": 3,
                "comment": "Can, but if you are below 25 got young driver fee. "
            },
            {
                "time created": "11/03/2019",
                "author": "SnottyMartian",
                "score": 2,
                "comment": " I rented when I just got my license when I was 19 at Gold Coast. However I had to call the company before renting from them to let them know "
            },
            {
                "time created": "11/03/2019",
                "author": "Stezo187",
                "score": 1,
                "comment": "I 2nd this. Its a fun drive, but can be a bit tricky in areas, especially if it's wet.\nGet full coverage.\nAlso don't speed. There are tons of speed cameras in that area."
            }
        ]
    },
    {
        "title": "Places to go by car in Singapore",
        "time created": "13/08/2021",
        "score": 11,
        "id": "p3gxf8",
        "url": "https://www.reddit.com/r/askSingapore/comments/p3gxf8/places_to_go_by_car_in_singapore/",
        "comments": [
            {
                "time created": "13/08/2021",
                "author": "riemannintegrable",
                "score": 16,
                "comment": "honestly as some one driving daily, SG is pretty damn nice for public transport. road trips are not very fun \n\nanyway here's a list:\n\n1) ECP crossing Marina Bay - scenic with F1 pit and Marina Bay buildings\n\n2) Tanah Merah Coast Rod - long stretch of empty road when you go at night. Very peaceful (don't speed, cameras everywhere) watching the streetlight go past.\n\n3) Yishun Dam - can stop road side and look at the sea. If you go on weekend midnight, there will be stretch of cars, ppl like to fish there. Just be careful of LTA cos it's technically double yellow line \n\n4) Random roads in Holland, Bukit Timah, and Bedok South area - i like rooming at 8 figure houses and there are lots of them there\n\n5) Mount faber during early morning\n\nif you're bored you can what i do, i drive to parks like kent ridge/ mount faber at night and just sit there and stone"
            },
            {
                "time created": "13/08/2021",
                "author": "FatGeckoBlub",
                "score": 12,
                "comment": "I'm not sure whether there's any scenic roads in Singapore that are actually worth specially driving.\n\nI sometimes drive up Mount Faber at night - it makes for a nice date. \n\nI've been to several places around the world where scenic routes are incredible, and that you have to totally drive to get that - but to actually rent a car just to travel around the concrete jungle that is Singapore doesn't make any sense in my honest opinion."
            },
            {
                "time created": "13/08/2021",
                "author": "anyhowack",
                "score": 4,
                "comment": "That depends on where you are located.\nGood places to drive to will be those that you can't usually access easily by public transport. \nEg punggol area but if you live there you can cycle around easily.."
            },
            {
                "time created": "13/08/2021",
                "author": "Character_Reward_816",
                "score": 4,
                "comment": "Up and down pan island expressway"
            },
            {
                "time created": "13/08/2021",
                "author": "iGoWalkWalk",
                "score": 5,
                "comment": "Try Sungei Buloh and Lim Chu Kang area. Visit the goat milk farm to feed goats and Bollywood Vege. Also try driving on an \"off-road\" dirt track on your way to the beach landing site:\n\nSarimbun Beach Landing Site\nhttps://maps.app.goo.gl/GufthJw7f4LMbg216\n\nHave fun!"
            },
            {
                "time created": "13/08/2021",
                "author": "bukitbukit",
                "score": 7,
                "comment": "99 Bends, drive up Kent Ridge Park. Long winding roads at Holland Hill, Mount Pleasant, Wessex Estate, Canterbury Road/Royal Road and Seletar Camp."
            },
            {
                "time created": "13/08/2021",
                "author": "BIG_KUKU_BIRD",
                "score": 2,
                "comment": "Msia"
            },
            {
                "time created": "13/08/2021",
                "author": "Radflagindicator",
                "score": 2,
                "comment": "I only mention this because I only get to drive around that area when I go for reservist.\n\nChangi Village\nThere's a bar there called Little Island brewing Co.\nThey make their own beer. You can dabao the beer on tap also, bring some glass bottles. They also will sell you plastic bottles for that purpose, but I find it loses effervescence fast that way.\n\nThe changi village hawker centre has alot of good food too. There's also a shop (Makan Melaka) selling chendol just opposite the Nasi lemak stalls. The guy hand makes the green wormy things in the morning, so it's legit.\n\nChangi Chapel and Musuem is worth checking out if you want to learn more about ww2 history during the Japanese occupation. It's a replica of St George's Church, the original one is inside Changi Air Base and is off limits to civilians."
            },
            {
                "time created": "14/08/2021",
                "author": "ActionIsComin",
                "score": 2,
                "comment": "Geddong has some nice places to drive, if you want to experience offroading.\n\nThere's Sarimbun Beach Landing Site, where there's an unpaved road that you can drive on.\n\nThere's also Jalan Murai, which is totally unpaved and is basically a dirt track without any kind of paving. But stay on the trail, because I managed to ditch my car there once, driving into a mud pit.\n\nBoth roads need a car with high undercarriage clearance tho, like a suv or jeep. Your average city car might get pretty beat up."
            },
            {
                "time created": "13/08/2021",
                "author": "8cupswatereveryday",
                "score": 1,
                "comment": "farms area"
            },
            {
                "time created": "13/08/2021",
                "author": "coleslawunreformed",
                "score": 1,
                "comment": "malaysia once it is open again. best way to scratch that itch of going fast"
            },
            {
                "time created": "14/08/2021",
                "author": "L57S",
                "score": 1,
                "comment": "The limchukang to woodlands path , yyds"
            },
            {
                "time created": "14/08/2021",
                "author": "geesnail333",
                "score": 1,
                "comment": "Hot wheels beat that"
            },
            {
                "time created": "14/08/2021",
                "author": "rahjinoh",
                "score": 1,
                "comment": "Jewel -> Jurassic Mile -> ECP -> Sheares Avenue -> MCE -> Keppel Viaduct -> AYE -> South Buona Vista (99) -> West Coast Highway -> AYE -> Pioneer -> Joo Koon\n\nThen you can park cheaply at Warehouse Club for food, groceries and sporting equipments :)"
            },
            {
                "time created": "14/08/2021",
                "author": "unawhut",
                "score": 1,
                "comment": "Kranji Gallop!"
            },
            {
                "time created": "13/08/2021",
                "author": "salted_egg_crab",
                "score": 2,
                "comment": "Thanks a lot.\n\n>it's technically double yellow line\n\nThat reminds me I need to recall some of the traffic rules - especially differences between here and Europe, where I used to drive. I passed my basic theory test to convert my license around 4 years ago and since then never drove in Singapore"
            },
            {
                "time created": "13/08/2021",
                "author": "Im_scrub",
                "score": 2,
                "comment": ">Yishun Dam - can stop road side and look at the sea. If you go on weekend midnight, there will be stretch of cars, ppl like to fish there. Just be careful of LTA cos it's technically double yellow line\n\nIt's a single yellow towards the direction of Seletar, only the initial portion leading up to the dam is double yellow. \n\nAccording to onemotoring, single yellow means no parking on this side of the road between 7 am and 7 pm, except on Sundays and public holidays."
            },
            {
                "time created": "13/08/2021",
                "author": "salted_egg_crab",
                "score": 2,
                "comment": "Thanks for the reply. I can imagine scenic-wise Singapore is not the top destination. But I really want to try driving around here at least once."
            },
            {
                "time created": "13/08/2021",
                "author": "salted_egg_crab",
                "score": 2,
                "comment": "True, I stay in CBD. But I have been to many places before. Punggol area is relatively easily accessible by MRT."
            },
            {
                "time created": "13/08/2021",
                "author": "salted_egg_crab",
                "score": 2,
                "comment": "That would be fun too :)"
            },
            {
                "time created": "13/08/2021",
                "author": "salted_egg_crab",
                "score": 1,
                "comment": "Maybe one day, now not good moment."
            },
            {
                "time created": "13/08/2021",
                "author": "salted_egg_crab",
                "score": 1,
                "comment": "Thanks for recommendations. Little Island is one of my fav places. Changi Village area I know quite well. I'll check other places around Changi."
            },
            {
                "time created": "16/08/2021",
                "author": "salted_egg_crab",
                "score": 2,
                "comment": "Thanks for response. I was looking for paved areas as I rented normal road car. Maybe next time :)"
            },
            {
                "time created": "13/08/2021",
                "author": "salted_egg_crab",
                "score": 2,
                "comment": ">farms area\n\nu/8cupswatereveryday I'm sorry could you be more precise? I'm not originally from Singapore and Google does not give me clear answer on that."
            },
            {
                "time created": "16/08/2021",
                "author": "ActionIsComin",
                "score": 2,
                "comment": "If you ever feel the itch to explore, do bring along a friend or two.\n\nNot to sightsee, but to help you push the car out of a ditch if the worst happens XD"
            },
            {
                "time created": "13/08/2021",
                "author": "SkittyLover93",
                "score": 3,
                "comment": "Search for Kranji farms"
            },
            {
                "time created": "13/08/2021",
                "author": "8cupswatereveryday",
                "score": 3,
                "comment": "theres a lot of farms at lim chu kang,  i recommend to go on a weekend as they will put up more things on sales"
            },
            {
                "time created": "13/08/2021",
                "author": "salted_egg_crab",
                "score": 1,
                "comment": "Thanks guys!"
            }
        ]
    },
    {
        "title": "Is there any car rental company operating on weekends?",
        "time created": "06/08/2021",
        "score": 0,
        "id": "oz0e42",
        "url": "https://www.reddit.com/r/askSingapore/comments/oz0e42/is_there_any_car_rental_company_operating_on/",
        "comments": [
            {
                "time created": "06/08/2021",
                "author": "whatevername12345",
                "score": 2,
                "comment": "Maybe you would like to check out DriveLah?"
            },
            {
                "time created": "06/08/2021",
                "author": "purrfait",
                "score": 2,
                "comment": "You can try carlite. Works like bluesg but more variety of cars available at cheaper rates. Need to top up ur own petrol and use ur own cashcard tho. And to return it back at the same spot. Minimal rental period is 15 mins."
            },
            {
                "time created": "06/08/2021",
                "author": "salted_egg_crab",
                "score": 1,
                "comment": "Thanks. Actually I previously mistakenly thought DriveLah is like BlueSG but after looking at bit more I realized this is something completely different. Did you any experience with that?"
            },
            {
                "time created": "09/08/2021",
                "author": "salted_egg_crab",
                "score": 1,
                "comment": "I will have a look on that. Thanks!"
            },
            {
                "time created": "25/08/2021",
                "author": "whatevername12345",
                "score": 2,
                "comment": "Yes! It’s more like renting from car owners. I have tried, although price is on the higher side but at least the car won’t have the rental company sticker etc and u can do hourly or whole day rental etc. Booking was a breeze through their system and car should be in good condition since it is owned by someone"
            },
            {
                "time created": "26/08/2021",
                "author": "salted_egg_crab",
                "score": 2,
                "comment": "Thanks, I tried it too, and my opinion is very positive. I had really nice couple as the owner. Price was still decent, roughly the same as for normal hire, but I could pick up and drop off in the place near to me (as I could choose the car anywhere) and at time times that were convenient for me. I will definitely use that service more."
            }
        ]
    },
    {
        "title": "It’s been a really rough week",
        "time created": "17/05/2021",
        "score": 6,
        "id": "nejbye",
        "url": "https://www.reddit.com/r/askSingapore/comments/nejbye/its_been_a_really_rough_week/",
        "comments": [
            {
                "time created": "17/05/2021",
                "author": "hodlnautwallet",
                "score": 2,
                "comment": "Hey. Was a grab driver who got screwed over when Grab took over Uber and monopolised the market.\n\nThings you want to find out:\n\n-Calculate if it is much more worth it to forfeit the contract now, then if you were to slug it out for 3 months\n\n-Look for temporary or part-time jobs, even F&B to tide it out if you chose to slug. This what I did when Grab economy was down to pay off the rental until I couldn't. Nothing is too low for you right now if you're looking to survive.\n\n-Look at freelance delivery services for F&B businesses. This is tough to come by, but you can start looking for neighbourhood telegram groups and advertising your service in them (if group rules allow).\n\nI apologise I do not have much options for you because your situation is different from mine due to the current COVID-19 pandemic.\n\nI wish you all the best and I do hope that others have suggestions for you too!"
            },
            {
                "time created": "18/05/2021",
                "author": "Rayl24",
                "score": 1,
                "comment": "I thought new pdvl need 30 years old, you ORD in May at 30 years old?"
            },
            {
                "time created": "18/05/2021",
                "author": "Simon-Nickleson",
                "score": 1,
                "comment": "switch to parcel delivery, shipping business aren’t as affected as the rest."
            },
            {
                "time created": "17/05/2021",
                "author": "renaldildo",
                "score": 0,
                "comment": "Thank you for your insight! Didn’t think about freelance delivery services, will definitely give it a try"
            },
            {
                "time created": "18/05/2021",
                "author": "renaldildo",
                "score": 1,
                "comment": "I registered for my PDVL in July 2020, they only increased the minimum age to 30 in August 2020"
            },
            {
                "time created": "18/05/2021",
                "author": "Rayl24",
                "score": 3,
                "comment": "It rough to be out in the job market right now, try red mart delivery like this one for people with own car?\n\n\nhttps://sg.jooble.org/m/desc/3325157993774075517?ckey=redmart+delivery+driver&rgn=-1&pos=2&elckey=-5360342047044109206&p=1&sid=-4535311610436303469&age=313&relb=100&brelb=100&bscr=9073.432&scr=9073.432&iid=1443611500580207697\n\n\nNTUC seems to have a 3 month contract for driver, maybe check with them whether can use own car for higher pay too. \n\n\nAnyway, all the best for your studies."
            },
            {
                "time created": "18/05/2021",
                "author": "renaldildo",
                "score": 1,
                "comment": "Damn this is really helpful, thank you so much for the help"
            }
        ]
    },
    {
        "title": "Best way to get furniture, goods delivered to my new unit?",
        "time created": "16/04/2021",
        "score": 1,
        "id": "mrurwl",
        "url": "https://www.reddit.com/r/askSingapore/comments/mrurwl/best_way_to_get_furniture_goods_delivered_to_my/",
        "comments": [
            {
                "time created": "16/04/2021",
                "author": "fdww",
                "score": 3,
                "comment": "Take a look at Expat groups on Facebook. Lots of people leaving recently who are looking to sell off their goods quickly and cheaply."
            },
            {
                "time created": "16/04/2021",
                "author": "drdeepakjoseph",
                "score": 2,
                "comment": "Google 'gogovan'. You can book and pay online. Cheap too"
            },
            {
                "time created": "16/04/2021",
                "author": "mrmeowman",
                "score": 2,
                "comment": "IKEA has its own delivery service, and if you keep your eyes peeled, you might see a Gogovan stand just past the checkout counters. They can help you with the app and selecting the right kind of van/service to deliver your goods home. \n\nIf you buy second hand via Carousell or Facebook Marketplace, you can also try ordering a Gogovan or a Lalamove vehicle to help you move bulkier furniture items. \n\nAs for stores: IKEA should have you covered. For more stylish finds, try Hooga, Forty Two, Hipvan, Castlery, or even Shopee."
            },
            {
                "time created": "19/04/2021",
                "author": "CmDrRaBb1983",
                "score": 2,
                "comment": "For heavy duty furnitures, typically the sellers would have a delivery service. For non heavy duty ones you can try buying at supermarkets (ironing board, bath mat and etc). I know NTUC offers home delivery for purchases of more than $200."
            },
            {
                "time created": "16/04/2021",
                "author": "refurb",
                "score": 1,
                "comment": "IKEA delivers as far as I know."
            },
            {
                "time created": "16/04/2021",
                "author": "icelemonteaftw",
                "score": 1,
                "comment": "ikeafortytwo.sg"
            },
            {
                "time created": "16/04/2021",
                "author": "WorkForAhGong",
                "score": 1,
                "comment": "You can make a trip to ikea and get most of the things you need. You can arrange for delivery too."
            },
            {
                "time created": "16/04/2021",
                "author": "RateOfKnots",
                "score": 2,
                "comment": "Thank you! This is just what I needed to know"
            }
        ]
    },
    {
        "title": "New govt. rules, people who rent cars, what do you do?",
        "time created": "15/05/2021",
        "score": 5,
        "id": "ncguby",
        "url": "https://www.reddit.com/r/askSingapore/comments/ncguby/new_govt_rules_people_who_rent_cars_what_do_you_do/",
        "comments": [
            {
                "time created": "15/05/2021",
                "author": "hucks22",
                "score": 3,
                "comment": "First thing to do is obviously to approach the car rental company to explain your situation and try to seek a compromise."
            },
            {
                "time created": "16/05/2021",
                "author": "Weekly_Elevator1505",
                "score": 1,
                "comment": "Ask the car rental company if you're able to transfer the contract to another person, then find someone to take over the rental. U can help them top up about to encourage ppl to take up. Hopefully it works out for you"
            },
            {
                "time created": "15/05/2021",
                "author": "sojuBlast",
                "score": 1,
                "comment": "I have emailed and message the customer service but they have yet to get back to me. I checked during the CB period, they only gave rebates but didnt allow any return.."
            },
            {
                "time created": "18/05/2021",
                "author": "sojuBlast",
                "score": 2,
                "comment": "I’ve actually put out ads for relief driver but until now, nobody want to rent car, especially when cannot really go out also. Abit tough.."
            },
            {
                "time created": "15/05/2021",
                "author": "hucks22",
                "score": 1,
                "comment": "Hope you manage to work something out with them man. Good luck and hang in there!"
            }
        ]
    },
    {
        "title": "Car rental",
        "time created": "08/05/2021",
        "score": 4,
        "id": "n7oqfy",
        "url": "https://www.reddit.com/r/askSingapore/comments/n7oqfy/car_rental/",
        "comments": [
            {
                "time created": "08/05/2021",
                "author": "tmpze8",
                "score": 2,
                "comment": "u may try carlite. it accepts p plate drivers but u have to pay extra $100 deposit"
            },
            {
                "time created": "10/05/2021",
                "author": "hodlnautwallet",
                "score": 1,
                "comment": "You can try AKA Car Rental. They do offer to P-plates but prices might be a bit steep. Do follow them on Instagram!"
            },
            {
                "time created": "08/05/2021",
                "author": "Effective_Lumpy",
                "score": 2,
                "comment": "I also started using car lite when I first got my license. It’s easy to get started and and prices are competitive. \n\nI always wondered if they’d rather have a renter who just passed (and hopefully be more cautious) or one who hasn’t driven for two years since they passed because nobody would rent to them."
            }
        ]
    },
    {
        "title": "Car Renting (Tips, What to look out for etc.)",
        "time created": "03/04/2021",
        "score": 4,
        "id": "mj6n1v",
        "url": "https://www.reddit.com/r/askSingapore/comments/mj6n1v/car_renting_tips_what_to_look_out_for_etc/",
        "comments": [
            {
                "time created": "03/04/2021",
                "author": "ohsixtytwo",
                "score": 3,
                "comment": "Always pay attention to liability and worst case scenario stuff. E.g. If you get into accident, what’s your liability like. What’s your excess (amount you need to pay, whether full excess is due regardless of the extent of damage, or it’s only maxed out if damages surpass excess. \n\nFind out if tyre damage and windshield damage is covered in insurance, or not. Those are typically the most common damages while driving. \n\nWhile you’re maintains the car for a month, track your car costs, e.g. petrol, parking etc so you have a better understanding on the driving costs if you were to get a car after this."
            },
            {
                "time created": "03/04/2021",
                "author": "Akeamegi",
                "score": 2,
                "comment": "I never considered renting with that kind of duration (1 month), but for very short term rentals, I'm using Drive Lah, it's more like an Airbnb kind of setup, but you have Drive Lah as your third party in case disputes happen, plus rentals are covered by Tokio Marine insurance. \n\nMy most recent rental was during the Christmas season (4 days) - quite a good experience overall. Plus you can even find those cars that are near where you live for convenience purposes."
            }
        ]
    },
    {
        "title": "What to do after getting a license?",
        "time created": "18/01/2021",
        "score": 1,
        "id": "kzlahv",
        "url": "https://www.reddit.com/r/askSingapore/comments/kzlahv/what_to_do_after_getting_a_license/",
        "comments": [
            {
                "time created": "18/01/2021",
                "author": "dogssel",
                "score": 4,
                "comment": "There should be refresher courses at the driving centre. Might worth a check. You can also put up a p plate so that drivers are aware that you are a \"new\" driver"
            },
            {
                "time created": "18/01/2021",
                "author": "deadbutpink",
                "score": 3,
                "comment": "What my dad does is to stay beside me when I drive so maybe you can try that! Then maybe you can start out at the top floor of MSCPs or even around the neighborhood. I won't advise going to the expressway without any practice first tho!"
            },
            {
                "time created": "18/01/2021",
                "author": "preddy25",
                "score": 2,
                "comment": "Get into a BlueSG and drive around office districts during off-peak"
            },
            {
                "time created": "18/01/2021",
                "author": "deadbutpink",
                "score": 2,
                "comment": "Need one year to drive 🙁"
            },
            {
                "time created": "19/01/2021",
                "author": "hellochyren",
                "score": 2,
                "comment": "Just one more month for OP"
            }
        ]
    },
    {
        "title": "Temporary HDB parking? (rental car)",
        "time created": "10/11/2020",
        "score": 1,
        "id": "jrkywf",
        "url": "https://www.reddit.com/r/askSingapore/comments/jrkywf/temporary_hdb_parking_rental_car/",
        "comments": [
            {
                "time created": "10/11/2020",
                "author": "rtposter",
                "score": 1,
                "comment": "Park at ikea tampines. Lol"
            },
            {
                "time created": "10/11/2020",
                "author": "SkhoobyDoo",
                "score": 1,
                "comment": "Presumably you're not renting a car for 5 days to simply park it so you need calculate only the hours you don't use the car. How many hours is the car going to sit in a car park? Night parking at HDB car parks is a flat fee (I think it's $4.00) so that saves a fair bit.  \n\n\nHope that helps."
            },
            {
                "time created": "11/11/2020",
                "author": "smalldog257",
                "score": 1,
                "comment": "If there is a place with coupon parking you can save a bit by getting a whole day coupon.  Most places are electronic these days though."
            },
            {
                "time created": "10/11/2020",
                "author": "Lerlo12",
                "score": 1,
                "comment": "Hey thanks for the help. Yeah I just found out my house has the 5 dollar over night parking.. I guess I'll have to pay the day rates as per normal... Thanks"
            },
            {
                "time created": "11/11/2020",
                "author": "Lerlo12",
                "score": 1,
                "comment": "Oh... There is such a coupon? I will look into it, thanks!"
            },
            {
                "time created": "11/11/2020",
                "author": "SkhoobyDoo",
                "score": 1,
                "comment": "No worries, good luck."
            },
            {
                "time created": "11/11/2020",
                "author": "smalldog257",
                "score": 1,
                "comment": "$12 per day, 7am to 7am next day. You can also use the parking.sg app to pay for it."
            },
            {
                "time created": "11/11/2020",
                "author": "LinkifyBot",
                "score": 2,
                "comment": "**I found links in your comment that were not hyperlinked:**\n\n* [parking.sg](https://parking.sg)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20gbw32ix&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3"
            }
        ]
    },
    {
        "title": "Has anyone that has gone to / are currently pursuing a Bachelor's degree in Australia, willing to share your experience?",
        "time created": "13/09/2020",
        "score": 2,
        "id": "iryzmt",
        "url": "https://www.reddit.com/r/askSingapore/comments/iryzmt/has_anyone_that_has_gone_to_are_currently/",
        "comments": [
            {
                "time created": "14/09/2020",
                "author": "wanderer190420",
                "score": 2,
                "comment": "You can pm me if you like :)"
            },
            {
                "time created": "14/09/2020",
                "author": "yuanhannn",
                "score": 2,
                "comment": "You might want to join r/AAustralianteachers\nFellow ECE undergrad here but I did it at a private uni here in Sg. All the best!"
            },
            {
                "time created": "14/09/2020",
                "author": "pieredforlife",
                "score": 1,
                "comment": "I graduated from university of Newcastle nsw and I’ve been living in Sydney for the past 8 years"
            },
            {
                "time created": "15/09/2020",
                "author": "RedBerryAngel",
                "score": 1,
                "comment": "you are asking questions but don't stated where you are going to. OZ states have different ways/cultures and stuff. what's work in CBD Sydney (yes, i was a Sydneysider) doesn't fly in suburbans (yes, i stayed a while at 2 places), and more so if compare with other states."
            },
            {
                "time created": "14/09/2020",
                "author": "hellohappyfeet",
                "score": 1,
                "comment": "Thank you!"
            },
            {
                "time created": "15/09/2020",
                "author": "hellohappyfeet",
                "score": 1,
                "comment": "Ahhh haha sorry for not including it in! I'll be going to Wollongong, so UoW :)"
            },
            {
                "time created": "15/09/2020",
                "author": "RedBerryAngel",
                "score": 1,
                "comment": "WL is still a part of sydney, albeit tuas positioning alike, mate. \n\nan interesting choice of Uni, but what i can tell you is that for sydney, you don't necessarily need a car unless you plan to have long drives to other states. with varieties of red-blue-orange what's else weekly multi-transports cards usually can take you to normal places you want to be. even if you want a car, you gotta take into consideration of parking slots. it's easier to get that than in SG, for sure. \n\nWL is definitely away from the hustle bustle of CBD, so it might be easier if you can secure a spot at campus. the slots usually limited, depending on your luck. that's if you really plan to study and not clubbing/partying every weekends. if you're, you have choose a wrong uni.  \n\nif i recalled correctly, sharing a common room will cost approx. 300-400 bi weekly, excluding pub and internet. PUB usually cost 50 bucks, more during autumn-winter and summer. bunking into a hostel might cost more coz you get own room, with sharing amenities. \n\nyou're talking about culture. you gotta understand that it's depend on whom you're hanging around with. SGans tend to stick with SGans. few will break the circles and get friends with overseas students. different cultures, different habits. i can talk this for hours and will never end. in any case, it's pretty rare you will get to 'absorb' the local culture.  racism? one day if you're lucky, you will come across someone throw a remark 'true blue australian' in your face. sound familiar? yes. that's exactly what Singaporeans do to non Singaporeans here."
            }
        ]
    },
    {
        "title": "Car rental contract",
        "time created": "26/10/2020",
        "score": 1,
        "id": "jibsqp",
        "url": "https://www.reddit.com/r/askSingapore/comments/jibsqp/car_rental_contract/",
        "comments": [
            {
                "time created": "26/10/2020",
                "author": "okaykaren12",
                "score": 4,
                "comment": "You can fill a lawsuit or make a police report. I will assume the purpose of \"deposit\" is to ensure that if the car got into any accident, it will cover it and if the damage exceed the amount of deposit, you will need to add on. But from your case, the damage is below the repair cause so you should in fact be given the remaining amount back."
            },
            {
                "time created": "26/10/2020",
                "author": "ArribaAndale",
                "score": 1,
                "comment": "Isn’t there some form of insurance?"
            },
            {
                "time created": "26/10/2020",
                "author": "heyyaali",
                "score": 0,
                "comment": "The insurance he signed was “damage to vehicle, subjected to appended non-waiverable excess of $6000 for own damage claims” \nThe thing is he already paid for his own damage but they cannot return the deposit because there was an accident (written in the contract)."
            },
            {
                "time created": "26/10/2020",
                "author": "ArribaAndale",
                "score": 1,
                "comment": "Excess of 6000 is quite crazy! Sounds like the whole car needs to be scrapped. Is this a reputable car rental? After making good the damages, it should be considered “original state”? Else there’s no need to make good, just forfeit the deposit. I think you can lodge it with CASE. Highlight the lack of a customer copy of the contract as well as the deposit?"
            },
            {
                "time created": "26/10/2020",
                "author": "heyyaali",
                "score": 1,
                "comment": "The company have good reviews. The excess is very high due to him being a p plate driver. He is requesting the contract tomorrow. After that part we will think of what to do!"
            },
            {
                "time created": "26/10/2020",
                "author": "ArribaAndale",
                "score": 2,
                "comment": "👍🏼 all the best!"
            }
        ]
    },
    {
        "title": "Should I work for grab or gojek?",
        "time created": "11/12/2019",
        "score": 3,
        "id": "e94hb1",
        "url": "https://www.reddit.com/r/askSingapore/comments/e94hb1/should_i_work_for_grab_or_gojek/",
        "comments": [
            {
                "time created": "11/12/2019",
                "author": "sgsriram",
                "score": 5,
                "comment": "If I were you I would sign up for both and use them concurrently to reduce downtime between bookings."
            },
            {
                "time created": "11/12/2019",
                "author": "pixelmemories",
                "score": 1,
                "comment": "I'm not a driver but a customer.\n\nImo grab pairs driver and passengers better and usually finds passengers that are close to the driver whereas there's been many times where I've been paired with drivers really far away for Gojek (like mountbatten-CBD or tampines-changi airport kind of distance between passenger and driver in some cases idk why).\n\nGrab has grabshare too if you're interested in that"
            },
            {
                "time created": "12/12/2019",
                "author": "jhmelvin",
                "score": 1,
                "comment": "I believe there's RYDE that you can concurrently subscribe as well."
            },
            {
                "time created": "11/12/2019",
                "author": "GlassHalfFullWannabe",
                "score": 1,
                "comment": "Gojek please"
            },
            {
                "time created": "11/12/2019",
                "author": "hk2k1",
                "score": -5,
                "comment": "Grab"
            },
            {
                "time created": "11/12/2019",
                "author": "quickQn",
                "score": 1,
                "comment": "Ahh that's a pretty good idea"
            },
            {
                "time created": "11/12/2019",
                "author": "quickQn",
                "score": 1,
                "comment": "Do you mind explaining your answer?"
            },
            {
                "time created": "11/12/2019",
                "author": "sgsriram",
                "score": 1,
                "comment": "Just go online on both, when one pings go offline on the other. \n\nWhen the current trip’s about to end go online on the other one.\n\nIf both pings at the same time, accept the more favourable one and reject the other then go offline."
            },
            {
                "time created": "11/12/2019",
                "author": "hk2k1",
                "score": -13,
                "comment": "Grab"
            },
            {
                "time created": "11/12/2019",
                "author": "quickQn",
                "score": 1,
                "comment": "Is this what you're currently doing? And if so how much do you make a day before expenses ?"
            }
        ]
    },
    {
        "title": "Car rental",
        "time created": "20/08/2019",
        "score": 1,
        "id": "csyc37",
        "url": "https://www.reddit.com/r/askSingapore/comments/csyc37/car_rental/",
        "comments": [
            {
                "time created": "21/08/2019",
                "author": "tarunsatish",
                "score": 1,
                "comment": "Most rentals in Singapore look for 22 years of age and 2 or more years of driving experience. Some will still rent to you if you don't meet the requirements but will need you to pay more. You can go to drive.sg to look for rentals that cater to your needs."
            },
            {
                "time created": "21/08/2019",
                "author": "lazyboyzz92",
                "score": 1,
                "comment": "Yes many companies rent to ppl below the age of 25 even if you are a P-plate. But read the T&C's carefully and drive safely. Don't want to gave to pay that kind of excess their insurance charges in the event of an accident. Also on a side note, check and take pictures of all angles of the car before renting so they can't blame you for anything."
            },
            {
                "time created": "22/08/2019",
                "author": "shadowfloats",
                "score": 1,
                "comment": "It’s technically not allowed but some companies will still do it. You’re just not protected from as many things (talking about insurance etc) and you’ll probably have to pay a surcharge for being under the age limit and/or driving exp."
            },
            {
                "time created": "21/08/2019",
                "author": "cdsfrogman",
                "score": 2,
                "comment": "Some companies do. Just keep a lookout for the excess payout. And do some research about the company first before renting. B"
            }
        ]
    },
    {
        "title": "Sister chasing disabled brother out of the house. Looking for other perspectives and any advice.",
        "time created": "29/07/2021",
        "score": 170,
        "id": "otz0j7",
        "url": "https://www.reddit.com/r/askSingapore/comments/otz0j7/sister_chasing_disabled_brother_out_of_the_house/",
        "comments": [
            {
                "time created": "29/07/2021",
                "author": "thankiw",
                "score": 115,
                "comment": "The sister is a shit human being"
            },
            {
                "time created": "29/07/2021",
                "author": "pricklyheatt",
                "score": 92,
                "comment": "Ok, \n\nYou can go to the police for this. They will be able to settle this even if there’s a power of attorney signed. They will be able to step in if there’s a proof that there was an abuse of said authority. \n\nIf there was no power of attorney, the police can definitely step in and get restitution."
            },
            {
                "time created": "30/07/2021",
                "author": "gettheloutasia",
                "score": 65,
                "comment": "Get a lawyer specialising in disability rights, you can get a referral from Ministry of Law to make sure it's an accredited one.\n\nThere is no point to alert her by making a police report right now, she's so cruel, so inhumane, must treat her like an animal that attacks and be super careful to get the upper hand. You cannot let your guard down against this kind of people. Believe me I sued someone before and successfully.\n\nAlternatively is go to small claims court, only for smaller amounts so if exceed then need to get a proper lawyer and can't self represent.\n\nTell your friend not to worry, there're laws against mistreatment of disabled people, including swindling them of their finances. Black and white evidence from bank account, can get her for sure.\n\nMeanwhile, make sure friend has a safe place to go to, change all banking/HDB/singpass/email passwords to prevent further harm and can contact lawyers and authorities without sis finding out.\n\nCheck out charities for disabled people, they have advocates who can connect with lawyers, agencies, etc. Can stay with other people first if possible so sis won't abuse further, have better mental clarity to handle this rubbish mess. Can also check out facilities for disabled people if friends can't help with lodging, more a matter of safety first, a few months until this is sorted out.\n\nI HATE liars and cheaters, HATE them!\n\nGood news is can sue for the money swindled, plus emotional distress and much more, so she got to pay back WITH interest and pay MORE for her crime or go to jail."
            },
            {
                "time created": "29/07/2021",
                "author": "ilovenoodles06",
                "score": 33,
                "comment": "Cross posted on r/sg. Hope it doesnt get taken down"
            },
            {
                "time created": "30/07/2021",
                "author": "c1efairy",
                "score": 16,
                "comment": "i am speechless. his sister is just wicked. imo this is where he should consult w a lawyer as they will be able to determine if her actions are unlawful as his power of attorney (is she even?). the brother can consider reaching out to MSF as soon as possible too. i am sorry for his circumstances and wish i can assist more."
            },
            {
                "time created": "30/07/2021",
                "author": "Godzillavio",
                "score": 7,
                "comment": "You’re not alone. I had seen disabled people driven out or being treated disrespectfully by their own families. I saw the comment that the police could intervene in family problems. I hope it will work out for your friend, OP!"
            },
            {
                "time created": "29/07/2021",
                "author": "cupcakefantasy",
                "score": 7,
                "comment": "I am not a lawyer. Maybe he can see if a lawyer is willing to take on his case (cause he has low funds), then sue the sister? Cause if she took his money, there may be a paper trail. I mean if the alternative is that he's gonna have to spend a lot of money to buy a new house and hire caretaker etc, might as well try, he may be able to get back some money that he can use. At least talk to a lawyer to see his options?"
            },
            {
                "time created": "30/07/2021",
                "author": "Cybersteel",
                "score": 7,
                "comment": "Sometimes blood doesn't make someone family."
            },
            {
                "time created": "30/07/2021",
                "author": "Fearless-Cookie",
                "score": 6,
                "comment": "I don’t have advice but check out some of the organizations like Fei Yue, Thye Hua Kwan and such and they could offer some support or direct to some resources. This is a seriously shitty situation and unfortunately quite common, but probably in the case of children vs. elderly parents. Since with bank account, maybe the money could be recovered back because it’s unauthorised withdrawal. \n\nUnpopular comment and maybe sound cruel, but the brother shouldn’t go light in his dealing with the sister, especially in possibilities when the sister has to be charged or brought to court. He should stand firm and fight for his rights since he has already seen what the sister can do, so if he has a case, hopefully he wouldn’t be too emotional. If he has any evidence like text messages, emails, or whatever that could work in his favour, KEEP IT.\n\nWorse case is the brother can rent a flat from HDB if the sister is not chargeable."
            },
            {
                "time created": "30/07/2021",
                "author": "Gekkim33",
                "score": 5,
                "comment": "\" had been in control of his bank account\" sounds like first step is to stop this access immediately\n\npeople can treat each other badly either due to self or maybe some unmentioned past wrongdoing which us as outsider have no knowledge. but alas 2 wrongs wont make right either way"
            },
            {
                "time created": "30/07/2021",
                "author": "Boomstikx",
                "score": 2,
                "comment": "Get a lawyer. The sums involved are too high and the impact on your friend too significant."
            },
            {
                "time created": "30/07/2021",
                "author": "CanardJauneQuack1",
                "score": 1,
                "comment": "Maybe make an appointment with one of those free legal clinics first?"
            },
            {
                "time created": "30/07/2021",
                "author": "daziedaze",
                "score": 1,
                "comment": "Rental flats?"
            },
            {
                "time created": "30/07/2021",
                "author": "RedBerryAngel",
                "score": 1,
                "comment": "go get a probono lawyer quick. that will be the starting point. let the lawyer and his connections to start the ball rolling."
            },
            {
                "time created": "30/07/2021",
                "author": "Szklm",
                "score": -2,
                "comment": "How old is the brother? Given that things have become this way, can he gain control of his bank account now and get her to return him the 200k?\n\nIf so, I'm not sure what else he can do besides moving out...then going to govt agencies for assistance for caregiving and meals"
            },
            {
                "time created": "30/07/2021",
                "author": "jellydubu",
                "score": 18,
                "comment": "It’s ok if you dont know but, do you know what would be the amount in restitution he could get in this kind of situation?"
            },
            {
                "time created": "29/07/2021",
                "author": "jellydubu",
                "score": 14,
                "comment": "Thank you so much!!"
            },
            {
                "time created": "30/07/2021",
                "author": "pricklyheatt",
                "score": 55,
                "comment": "Everything, but if they don’t have the money left, they will need to go to jail. \n\nThis actually happened to a relative, it’s 2 sisters taking advantage of an old aunt of theirs."
            },
            {
                "time created": "30/07/2021",
                "author": "Master_McKnowledge",
                "score": 31,
                "comment": "She may be forced to sell her flat and other assets to settle the judgment debt."
            }
        ]
    },
    {
        "title": "Got my driver's license, now what?",
        "time created": "27/07/2021",
        "score": 11,
        "id": "osg04r",
        "url": "https://www.reddit.com/r/askSingapore/comments/osg04r/got_my_drivers_license_now_what/",
        "comments": [
            {
                "time created": "27/07/2021",
                "author": "cryptotom1",
                "score": 11,
                "comment": "You could always plan a day of fun, then rent a car for the day (plenty of places on carousell for $50 a day that’ll rent out CoE renewed 15 year old+ Honda Jazz/ Toyota Vios) and drive some places. \n\nI did a day with a friend and his son before where we did a history day and drove to a number of locations significant to WW2."
            },
            {
                "time created": "27/07/2021",
                "author": "p1nkp3ngu1n",
                "score": 5,
                "comment": "deposit/innsurance is possible but q expensive for p plate rental..... most kids i know just wait 1-2 years then rent lol"
            },
            {
                "time created": "27/07/2021",
                "author": "None",
                "score": 5,
                "comment": "[deleted]"
            },
            {
                "time created": "27/07/2021",
                "author": "AsleepStranger7",
                "score": 8,
                "comment": "What about bluesg? Personally getting my license although not planning to get a car as it’s an essential skill:))"
            },
            {
                "time created": "27/07/2021",
                "author": "tymelodies",
                "score": 2,
                "comment": "After passing my license, I haven't even drive a year after that."
            },
            {
                "time created": "27/07/2021",
                "author": "Form_Historical",
                "score": 2,
                "comment": "I had similar dilemma sometime back. Like some people suggested you can rent car from rental companies who allow renting to p-plate drivers. I have done this for over the weekend and it was good fun.\n\nBut for more regular basis getting membership from likes of Tribecar make good sense as you most likely will have pick-up points near your place.\n\nAgain take tons of photos, understand their Ts and Cs and buy additional coverage to protect yourself before you turn on that ignition.\n\nEnjoy Driving!"
            },
            {
                "time created": "27/07/2021",
                "author": "CSlv",
                "score": 2,
                "comment": "Wait 2 more years. Premiums and Excess for new drivers are a lot higher."
            },
            {
                "time created": "27/07/2021",
                "author": "hydrangeapurple",
                "score": 5,
                "comment": "Cars are probably the biggest depreciating \"asset\" you can probably own in Singapore. Suggest you avoid owning a car unless you are uber rich or you absolutely need it."
            },
            {
                "time created": "27/07/2021",
                "author": "BaloneyInCharge",
                "score": 2,
                "comment": "I got my license in 2018 and have driven a total of 6 times since then. I don’t see a need for a car unless I’m going to some ulu as balls place or am going furniture shopping or something but you can just borrow a car or rent one when you need it."
            },
            {
                "time created": "27/07/2021",
                "author": "Emergency_Intrepid",
                "score": 1,
                "comment": "grab is your best friend"
            },
            {
                "time created": "27/07/2021",
                "author": "S5olomon",
                "score": 1,
                "comment": "I’d go with some of the suggestions here and rent a car over a few months. It’s headache free and let’s you concentrate on the driving rather than the maintaining.\n\nAs to owning a car, it all depends on your affordability. I’d only feel confident owning a car if my annual salary minus other loans were 2x the price of the car and 10x the annual depreciation plus other costs.\n\nNot owning a car in Singapore is fully justified given there’s a world class transport system and ride hailing coverage everywhere 24/7. But still, I’m a petrolhead and you’d have to pry the steering wheel from my cold dead hands before I give up car ownership."
            },
            {
                "time created": "27/07/2021",
                "author": "Tongchokgoh",
                "score": 1,
                "comment": "Volunteer to drive for friends or relatives who have cars. This will keep you practising and hone your driving skills."
            },
            {
                "time created": "27/07/2021",
                "author": "Outside-Economics668",
                "score": 1,
                "comment": "It's time to put the down payment for a new tesla!"
            },
            {
                "time created": "27/07/2021",
                "author": "ohsixtytwo",
                "score": 1,
                "comment": "Recommend you borrow from friends or other relatives who might have a vehicle. Have them sit beside you while you drive, so they can help you check and look out for dangers. \n\nCar sharing services are fine, but the risk is always in the worst case scenario. If you get into an accident, no matter how minor, rental services bear the right to charge you the full excess. There were quite a few such cases on HWZ for BlueSG where they parked improperly and dented the front bumper, and BlueSG charged them the full $3K or something excess even though the repair costs are nowhere as high. \n\nIf you wanna yolo, go for it. But imo it’s not worth the risk."
            },
            {
                "time created": "28/07/2021",
                "author": "smalldog257",
                "score": 1,
                "comment": "Wait until the causeway reopens, rent a car in JB and go for a road trip in Malaysia."
            },
            {
                "time created": "28/07/2021",
                "author": "taenyfan95",
                "score": 1,
                "comment": "My advice is take is easy. Even if you've passed your driving test, going onto the expressway where there are lots of cars traveling at high speeds can be a daunting experience for first timers. Try to get an experienced friend/family member accompany and guide you on your first \\~10 drives or so."
            },
            {
                "time created": "27/07/2021",
                "author": "hiimekko",
                "score": 1,
                "comment": "This sounds like a good idea. Thank you."
            },
            {
                "time created": "27/07/2021",
                "author": "hiimekko",
                "score": 2,
                "comment": "I shall check these out, thank you."
            },
            {
                "time created": "27/07/2021",
                "author": "Acremaster45",
                "score": 5,
                "comment": "BlueSG can only use after the 1 year probation period"
            },
            {
                "time created": "27/07/2021",
                "author": "autistic_penguin_kai",
                "score": 2,
                "comment": "I believe bluesg doesn't allow allow P-plate drivers to rent."
            },
            {
                "time created": "27/07/2021",
                "author": "hiimekko",
                "score": 3,
                "comment": "Yep. Similar to what the other comments have said. Unfortunately need to wait for 1 full year. Might forget driving during that time if I don't practice haha."
            },
            {
                "time created": "27/07/2021",
                "author": "PhuckMeDead",
                "score": 1,
                "comment": "Got my license 10 years ago. \n\nDrove a car less then 20 times since then."
            },
            {
                "time created": "27/07/2021",
                "author": "casiotech",
                "score": 2,
                "comment": "sounds like what OP is saying is that it only makes rational sense for regular people to get it as a work or business need or you have the disposable income to\n\nbut of course, different people have their own reasons for getting a car"
            },
            {
                "time created": "27/07/2021",
                "author": "hiimekko",
                "score": 1,
                "comment": "Definitely not planning on owning a car any time soon. But I love driving and would like to keep practicing. Seems like the general consensus is to rent for a weekend or a few months. Thanks!"
            },
            {
                "time created": "27/07/2021",
                "author": "autistic_penguin_kai",
                "score": 6,
                "comment": "Not OP, but I certainly agree with him. Too many people buy cars without being able to comfortably afford them. My cousin just got a 2 door maserati apparently thanks to the extra money he got from sign-on bonus. Probably combine with whatever savings he and his wife has. They haven't considered that the income they both earn will likely be insufficient towards paying for their BTO and raising a kid, while being able to have sufficient income to save and live on after the big expenses come in.\n\nNot saying everyone is like that, but owning a car is still seen as a 'status symbol'. No reason to get one unless you can afford to or if the benefits the car provides are really great. Boyfriend's planning to just get a decent Hyundai so the commute to his future workplace (Gedong Camp) will be a lot less painful. For him its more than 30min~1hr time saved if he drives there one way, so it's something that can be considered vs buying expensive car for 'face'."
            },
            {
                "time created": "27/07/2021",
                "author": "hiimekko",
                "score": 3,
                "comment": "You guys are reading too much into it. I just want to be able to practice every now and then. I spent a lot getting this license, its pointless if i forget the skills and would have to go for some kind of refresher course"
            },
            {
                "time created": "27/07/2021",
                "author": "casiotech",
                "score": 2,
                "comment": "ah the inaccessibility of workplace, plenty of my colleagues then got a car/motorcycle coz of that. \n\nFor context, my old workplace was a 30mins direct bus ride from the nearest mrt, which itself was at the edge of the mrt map."
            },
            {
                "time created": "27/07/2021",
                "author": "autistic_penguin_kai",
                "score": 1,
                "comment": "Can completely agree with your point abt not putting the license to waste. Best to get some driving experience right after getting your license as that one year is crucial to your development for driving style and experience."
            },
            {
                "time created": "27/07/2021",
                "author": "Striking-Detective40",
                "score": 1,
                "comment": "I doubt you wont forget to drive tbh. Most of the people dont drive till their P plate is over to be safe (demerit point is only 12 max for p plate go over that 13 u can say goodbye to your license). The only struggle u get is parking hahaha but if u gonna drive at night/non peak u can take your own sweet time in parking the car"
            }
        ]
    },
    {
        "title": "Car Rental Apps",
        "time created": "03/09/2021",
        "score": 3,
        "id": "ph6fgj",
        "url": "https://www.reddit.com/r/askSingapore/comments/ph6fgj/car_rental_apps/",
        "comments": [
            {
                "time created": "03/09/2021",
                "author": "durianboy19",
                "score": 3,
                "comment": "Try get go - right now has some discount"
            },
            {
                "time created": "04/09/2021",
                "author": "Akeamegi",
                "score": 1,
                "comment": "Drive Lah, it's more like a p2p car sharing platform (like airbnb) so you deal with car owners directly. Good thing is, rentals are covered with insurance, and you have drive lah to handle diaputes just in case.\n\nI've tried it last christmas for 4 days, not too bad."
            },
            {
                "time created": "04/09/2021",
                "author": "NormanDzulkarnaen",
                "score": 1,
                "comment": "Aye thanks man.... I just downloaded it just now... Hopefully I'll get to try it soon"
            }
        ]
    },
    {
        "title": "Car renting services",
        "time created": "15/08/2021",
        "score": 3,
        "id": "p4txk4",
        "url": "https://www.reddit.com/r/askSingapore/comments/p4txk4/car_renting_services/",
        "comments": [
            {
                "time created": "15/08/2021",
                "author": "hucks22",
                "score": 2,
                "comment": "https://www.reddit.com/r/askSingapore/comments/n7oqfy/car_rental/"
            },
            {
                "time created": "15/08/2021",
                "author": "Rajeshmhn9",
                "score": 1,
                "comment": "Am pretty sure I came across 1 or 2. Just Google them. But be very careful driving as the insurance excess is sky high for newbies."
            },
            {
                "time created": "15/08/2021",
                "author": "thehiddenstreets",
                "score": 1,
                "comment": "Bluesg requires 1 year. I think tribecar allows new drivers to rent but you’ll be paying extra vs. the rest of the drivers"
            },
            {
                "time created": "15/08/2021",
                "author": "sojuBlast",
                "score": 1,
                "comment": "You can try dreamcar rental, they are very transparent with their pricing, allows p-plate drivers and extremely good customer service. I rented my first car a week after i got my license with them and the process was super easy. The car i rented was quite new. For returns, just drive there and the uncle knows that u returning alr. \n\nEdit: i just saw their ratings on google was quite low, but ive rented from them about 6-7 times alr and i never had a problem. Unlike tribecar, every rental got problem, they will blame u for causing damages even when you didnt and always finding ways to make u pay more."
            },
            {
                "time created": "16/08/2021",
                "author": "tmpze8",
                "score": 1,
                "comment": "Carlite"
            }
        ]
    },
    {
        "title": "Full-Day Car Rental Recommendations",
        "time created": "29/03/2021",
        "score": 1,
        "id": "mfk6jb",
        "url": "https://www.reddit.com/r/askSingapore/comments/mfk6jb/fullday_car_rental_recommendations/",
        "comments": [
            {
                "time created": "29/03/2021",
                "author": "propapmaybe",
                "score": 2,
                "comment": "I used to use BKW rentals. Good rate. No frills. Nice local company feeling."
            }
        ]
    },
    {
        "title": "What do I need to know before owning a car?",
        "time created": "26/07/2020",
        "score": 1,
        "id": "hxq1pp",
        "url": "https://www.reddit.com/r/askSingapore/comments/hxq1pp/what_do_i_need_to_know_before_owning_a_car/",
        "comments": [
            {
                "time created": "26/07/2020",
                "author": "None",
                "score": 2,
                "comment": "[deleted]"
            },
            {
                "time created": "26/07/2020",
                "author": "Amazed_atstupid",
                "score": 1,
                "comment": "A few useful links .\nhttps://www.onemotoring.com.sg/content/onemotoring/home/owning.html\n\nSgcarmart.com for listing of second hand cars.  You can list by annual depreciation to suit your budget \n\nAdvice :\n1.  Don't go for high loans as it means you can't really afford it.\n\n2. Make sure you compare the interest rates . Currently  Maybank is offering 1.88% .  Some dealers will push for finance companies which charge much higher because you either have a bad credit report or your income does not satisfy MAS requirements. \n\n3. Unless your salary is high, refrain from buying a car so soon.  It will be a drain on your finances.   Unless you need it for your work otherwise you are just paying for it to be parked the whole day.\n4.  If you decide to proceed with the purchase make sure you ask for the car to be send for inspection.  You want o know how much money to set aside for repairs.\n."
            },
            {
                "time created": "26/07/2020",
                "author": "None",
                "score": 1,
                "comment": "Fuel - 100-200 per month\nNew car low tier - 60k\nInsurance for 20ish youngster - 2-3k a year\nViolate traffic rule - 200 dollars? Idk\nParking fee - 100-200/month\n\nU do the math yourself.\n\nAt the end of the day, main pt is if u have lots of daddy cash in go for it.\n\nIf not just take bus 11"
            },
            {
                "time created": "30/07/2020",
                "author": "None",
                "score": 1,
                "comment": "I'm paying $60 a week for 3/4 tank after 25% discount with sinopec. Why did u extend your service btw?\n\nBuy second hand car and learn, everything is included in the deal at the price you agree with the former owner of secondhand, car dealer. You need to equip yourself with car insurance which can you can get online. Just learn on the go. Enjoy driving!"
            },
            {
                "time created": "26/07/2020",
                "author": "bihoxodiy",
                "score": -1,
                "comment": "Your dad would probably teach you since he's paying for the car"
            },
            {
                "time created": "26/07/2020",
                "author": "XiaoMeiMeiHunter",
                "score": 1,
                "comment": "What about stuff like COE? How would that work if I'm buying a secondhand vehicle?"
            },
            {
                "time created": "26/07/2020",
                "author": "LinkifyBot",
                "score": 2,
                "comment": "**I found links in your comment that were not hyperlinked:**\n\n* [Sgcarmart.com](https://Sgcarmart.com)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20fza982e&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3"
            },
            {
                "time created": "27/07/2020",
                "author": "MyCatIsAHouseElf",
                "score": 1,
                "comment": "+ repairs and rainy day fund"
            },
            {
                "time created": "26/07/2020",
                "author": "XiaoMeiMeiHunter",
                "score": 1,
                "comment": "It's actually because I don't have someone like that to turn to thus I'm asking here, but thanks for the point. 😅"
            }
        ]
    },
    {
        "title": "Car Rental in Singapore",
        "time created": "31/01/2019",
        "score": 2,
        "id": "alokn1",
        "url": "https://www.reddit.com/r/askSingapore/comments/alokn1/car_rental_in_singapore/",
        "comments": [
            {
                "time created": "31/01/2019",
                "author": "Stezo187",
                "score": 1,
                "comment": "It's quite common for people to rent cars.\nThe big name places will charge way too much.\n\nhttp://www.chans.com.sg\n\nI recommend them. I used them for a 2yr rental, and brother in law has been using them for quite a while.\n\nGood service. Look to pay 1500-2000 a month for a basic car."
            },
            {
                "time created": "31/01/2019",
                "author": "BaronGreenback75",
                "score": 1,
                "comment": "We owned a car for 5 years. When the COE expired we looked at the costs of a replacement or long term lease. We went for the latter. First company we tried had a cowboy feel to it. Tried to add extra 5% because I wanted to pay by visa, no service report, didn’t mention GST until time to pay. Just didn’t feel like I could trust them. Friend mentioned comfortdelgro. Have been using them now since 2015 and am very happy. Great customer service. On site service (work or home). Courtesy car if further service required. Little free gifts here & there etc etc. "
            },
            {
                "time created": "31/01/2019",
                "author": "thankfool",
                "score": 1,
                "comment": "If it’s solely used for commuting to work, you might want to try car sharing, where you pick up and drop off the cars at specific locations. I use Smove and they have dozens of locations to choose from."
            },
            {
                "time created": "31/01/2019",
                "author": "methodica1madness",
                "score": 1,
                "comment": "thanks! are there a lot of small car rental companies in Singapore? I'm doing a research :)"
            },
            {
                "time created": "31/01/2019",
                "author": "Stezo187",
                "score": 1,
                "comment": "Yes lots of rental companies."
            }
        ]
    },
    {
        "title": "Cost of living?",
        "time created": "27/05/2015",
        "score": 0,
        "id": "37fb6m",
        "url": "https://www.reddit.com/r/askSingapore/comments/37fb6m/cost_of_living/",
        "comments": [
            {
                "time created": "27/05/2015",
                "author": "Schlego",
                "score": 1,
                "comment": "a) Housing\na-1) Rent seems to be expensive, but I wonder if it is the same everywhere?\n\nOf course rent depends on so many factors: proximity to MRT (train) stations, size of flat, area, how new it is, whether it's a condominium or a public housing flat. \n\na-2) There seems to be two types - entire house for rent or partial house (some rooms)\na-3) I'm married so I want to live in a house that is fully occupied by us\na-4) I'm okay with a one bedroom house\n\nI could be wrong but I don't think I've come across a one bedroom house. The smallest ive seen is 2 bedrooms. \n\na-5) I'm also okay with 30 - 60 minutes of commute.\na-6) What localities should I search for houses? And what are the average rents there?\n\nDepends on where your office is gonna be. \nIn Jurong East, Bukit Batok area.. common room - 400-700 is my guess. Master bedroom - 800-1000. \nFor an entire two bedroom unit, maybe 1.8-2.2k. \n\na-7) Do I need to pay an advance for the house before moving in? Like paying 12 months of rent in advance which will be returned to me when I leave that house (It's a common practice in India)\n\nUsually just one month deposit that's returned to you when you leave. 12 months? If anyone makes you pay that, they're cheating you. \n\na-8) Is there any other cost apart from rent? (like apartment maintenance fee, etc)\n\nIf you stay in a condominium, you might need to pay maintenance. Consider whether you'll really need a condo with swimming pool and gym and stuff. \n\nb) Transportation\nb-1) Cars are very expensive and I don't think I'll be able to afford them\nb-2) How much does it cost you to commute in bus/train per month?\n\nPublic transport is cheap. One way travel, max max max $3 per way. Assuming 2 way, 6/day * 30 days = 180 (Of course you don't work 30 days a month). \n\nc) Groceries and household items\nc-1) We are two persons and we mainly buy vegetables, fruits and rice.\nc-2) We try to be frugal as possible\nc-3) What would I be spending on the above items?\n\nUh, I spend about 200/month on the groceries mentioned above for 2.\n\nd) Mobile, Internet, TV etc\n\nd-1) I need to communicate with my family and friends in India, what is the best way to do this?\nFacetime? Skype? Whatsapp? I use all of these. \n\nd-2) Is calling over mobile networks cheaper over apps like skype? What about incoming calls over mobile networks? Just trying to get an idea here.\n\nIncoming calls are free for most postpaid plans. \n\nd-3) How much does Internet cost for usage like browsing, youtube, skype etc (No heavy downloads)\n\nUnlimited broadband access - I think it's between 45-65/month, depending on your speed and duration of contract etc. \n\nd-4) I don't watch TV but I think I'll buy one for my SO. How much do Indian channels package cost?\n\nHmm check Starhub cable tv's site. If I remember correctly from a few years ago, you need to get basic package + hindi/tamil/other channels, about 9/channel. Maybe a total of 40/month for cable tv. \n\ne) What is a reliable website to calculate tax?\n\nIRAS\n\nf) Did I miss any other important expenses?\n\nEating out? Come on, new place, you gotta try new food! :) (And yes, you can find loads of veg food here if that's your concern. )"
            },
            {
                "time created": "27/05/2015",
                "author": "singamove",
                "score": 1,
                "comment": "Hi,\n\nThanks a lot for the answers!\n\n> Of course rent depends on so many factors: proximity to MRT (train) stations, size of flat, area, how new it is, whether it's a condominium or a public housing flat.\n\nSorry for the miscommunication. I actually asked if rents differ significantly in different areas. For example rents in jurong east vs sentosa (random example)\n\n> Depends on where your office is gonna be. In Jurong East, Bukit Batok area.. common room - 400-700 is my guess. Master bedroom - 800-1000. For an entire two bedroom unit, maybe 1.8-2.2k.\n\nHow does the house sharing work out? Is it like multiple people sharing a house and they share the utilities/maintenance etc? Just wanted to confirm.\nAlso how does a condominium differ from public housing flats? \n\n> Eating out? Come on, new place, you gotta try new food! :) (And yes, you can find loads of veg food here if that's your concern. )\n\nYep, we do lots of eating out. But the prices at hawker centers looked affordable so I didn't ask. We'll also be going to parks and other areas.\n\nThanks again for your responses! :)\n\n"
            },
            {
                "time created": "27/05/2015",
                "author": "tehokosong",
                "score": 1,
                "comment": "Generally if you live further from central region (Bishan, Orchard, TPY, etc) rent gets cheaper. Also places like tiong bharu area is pretty pricey."
            },
            {
                "time created": "27/05/2015",
                "author": "Schlego",
                "score": 1,
                "comment": "Condominium is basically a gated community - comes with facilities such as swimming pool, gym, tennis courts, function room, security guard of course, etc. \n\nHouse sharing - really depends on you. I've seen 2 families sharing a 2 bedroom apartment. I've also seen the owner living in their apartment but renting out a master bedroom. \n\nSentosa? Uh Sentosa cove is like maybe 15000/month? Lol. There's no comparison. \n\nDefinitely prices are higher in central region. If a 45-60min commute is fine, choose something in the heartlands. \n\nWhere's your office gonna be? "
            },
            {
                "time created": "27/05/2015",
                "author": "None",
                "score": 1,
                "comment": "[deleted]"
            },
            {
                "time created": "28/05/2015",
                "author": "Schlego",
                "score": 1,
                "comment": "Bukit Batok, Bukit Gombak. Close enough, (1 and 2 stops by MRT respectively). Not that expensive. Not as crowded as Jurong East as well. Definitely cheaper and less crowded than Clementi as well. "
            }
        ]
    }
]