[
    {
        "title": "New application of WORK PASS during COVID-19 pandemic",
        "time created": "13/08/2020",
        "score": 2,
        "id": "i8hvxv",
        "url": "https://www.reddit.com/r/askSingapore/comments/i8hvxv/new_application_of_work_pass_during_covid19/",
        "comments": [
            {
                "time created": "14/11/2020",
                "author": "justanotherstark",
                "score": 1,
                "comment": "I am in a similar situation at this point of time. My employer applied for my work pass 4 weeks ago. Can you share your experience on how much time it took to receive the IPA?"
            },
            {
                "time created": "13/08/2020",
                "author": "hikari8807",
                "score": 1,
                "comment": "We are applying work pass for our new hire. The application is still stucked w MOM. We are keeping our fingers cross. There is definitely a tangible difference in the processing speed before and after COVID19. Hope that helps."
            },
            {
                "time created": "14/11/2020",
                "author": "babyderpina",
                "score": 1,
                "comment": "Hi. I never got a approval because I'm not in SG. My supposed employer didn't file an appeal because it said we can only do it if I'm there or when the current rules are more relaxed."
            },
            {
                "time created": "13/08/2020",
                "author": "babyderpina",
                "score": 1,
                "comment": "Thanks for replying! When did you submit the application? Are in any of the prioritized sector: healthcare or transport?"
            },
            {
                "time created": "14/08/2020",
                "author": "Earlgreygrey",
                "score": 1,
                "comment": "May i ask which day did u apply for you new hire ? Thanks"
            },
            {
                "time created": "13/08/2020",
                "author": "hikari8807",
                "score": 2,
                "comment": "My is more academic. So i guess MOM don't give us much a hoot. Although we are doing healthcare research. Good luck to you."
            },
            {
                "time created": "13/08/2020",
                "author": "babyderpina",
                "score": 1,
                "comment": "Thank you. I appreciate  your kind replies. Same with you. Stay safe!"
            }
        ]
    },
    {
        "title": "Are HDB BTO units a long term Investment Vehicle?",
        "time created": "25/02/2020",
        "score": 6,
        "id": "f909qs",
        "url": "https://www.reddit.com/r/askSingapore/comments/f909qs/are_hdb_bto_units_a_long_term_investment_vehicle/",
        "comments": [
            {
                "time created": "25/02/2020",
                "author": "kiatme",
                "score": 3,
                "comment": "So what's the question ?\nIf you're planning to calculate losses, and want to be very specified, you need to include the following :\n- buyer stamp duty\n- principal interest (just find any calculators and calculate)\n- renovation costs\n- town council/property tax per month\n- agent fee for selling \n\nThe market now is not like last time already, last time non-matured estates are undersubscribed so it's easy to get a decent unit, and were way cheaper, now everywhere except tengah is oversubscribed, so you'll be lucky to even get a decent queue number. BTO is good if you're able to grab the grants as well, otherwise if you factor in the above, you won't be making much profit when you sell in the future.\n\nIs BTO a long term investment? I feel no, but given the options available, BTO is still the best in the market, I feel if you want to buy a property now, buy for the need, not the greed, whatever profit you make from your current one, you'll have to put into renovation for the new house as well.\n\nWhen you calculate remember to keep 20k in CPF OA to enjoy the 3.5% interest"
            },
            {
                "time created": "11/03/2020",
                "author": "None",
                "score": 2,
                "comment": "[removed]"
            },
            {
                "time created": "01/03/2020",
                "author": "MilkApe",
                "score": 1,
                "comment": "[[CNA-lifestyle] Selling your flat soon after MOP: Is it as smart a move as you think it is?](https://cnalifestyle.channelnewsasia.com/trending/selling-your-flat-soon-after-minimum-occupancy-period-12479550)"
            },
            {
                "time created": "25/02/2020",
                "author": "MCKawe",
                "score": 1,
                "comment": "As prices of HDB BTOs are controlled by the government to provide affordable housing, i can see two routes if you plan to make HDBs an investment play. This is because even in the resales, they will be generally benchmark to the BTO pricing within the area.\n\n1) When a non-mature estates transitions to a mature estate. For most, it will be a significant rise in value and since the physical value is low, the % returns are generally higher.\n\n2) When you hit the lottery and get a BTO in a hot estate (i.e Duxton or the upcoming Southern Waterfront Area)"
            },
            {
                "time created": "12/03/2020",
                "author": "MilkApe",
                "score": 1,
                "comment": "This is very good read! They really have gone quite in-depth into what I was trying to find out. But it does look in line with my initial guess"
            },
            {
                "time created": "12/03/2020",
                "author": "dozome",
                "score": 2,
                "comment": "I'm glad you find this a good read. \n\nHopefully it helps you to have a clearer picture of the answer you are seeking. \n\nActually I wrote this article after I saw your post 😁"
            },
            {
                "time created": "21/03/2020",
                "author": "MilkApe",
                "score": 1,
                "comment": "Reddit at it's best :) Thank you Sir! for your hard work."
            }
        ]
    }
]